// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>

using namespace std;
int main()
{
    cout << "Hello World!\n"; //test
    
    const double PI = 3.1415926;
    double z1, z2, a, b;

    cout << "Vvedite a b\n";

    cin >> a >> b;

    z1 = 2 * (pow((sin(3 * PI-2 * a)), 2) * pow(cos((5 * PI) + 2 * a) , 2));
    z2 = (1. / 4) - (1. / 4) * sin((5. / 2) * PI - (8 * a));

    cout << z1 << "\n" << z2 << "\n";
    
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
